{"id":"google/protobuf/fieldmask","name":"FieldMask","title":["Google","Protobuf","FieldMask"],"description":"<p>+FieldMask+ represents a set of symbolic field paths, for example:</p>\n\n<pre><code>paths: \"f.a\"\npaths: \"f.b.d\"\n</code></pre>\n\n<p>Here +f+ represents a field in some root message, +a+ and +b+\nfields in the message found in +f+, and +d+ a field found in the\nmessage in +f.b+.</p>\n\n<p>Field masks are used to specify a subset of fields that should be\nreturned by a get operation or modified by an update operation.\nField masks also have a custom JSON encoding (see below).</p>\n\n<p>= Field Masks in Projections</p>\n\n<p>When used in the context of a projection, a response message or\nsub-message is filtered by the API to only contain those fields as\nspecified in the mask. For example, if the mask in the previous\nexample is applied to a response message as follows:</p>\n\n<pre><code>f {\n  a : 22\n  b {\n    d : 1\n    x : 2\n  }\n  y : 13\n}\nz: 8\n</code></pre>\n\n<p>The result will not contain specific values for fields x,y and z\n(their value will be set to the default, and omitted in proto text\noutput):</p>\n\n<pre><code>f {\n  a : 22\n  b {\n    d : 1\n  }\n}\n</code></pre>\n\n<p>A repeated field is not allowed except at the last position of a\npaths string.</p>\n\n<p>If a FieldMask object is not present in a get operation, the\noperation applies to all fields (as if a FieldMask of all fields\nhad been specified).</p>\n\n<p>Note that a field mask does not necessarily apply to the\ntop-level response message. In case of a REST get operation, the\nfield mask applies directly to the response, but in case of a REST\nlist operation, the mask instead applies to each individual message\nin the returned resource list. In case of a REST custom method,\nother definitions may be used. Where the mask applies will be\nclearly documented together with its declaration in the API.  In\nany case, the effect on the returned resource/resources is required\nbehavior for APIs.</p>\n\n<p>= Field Masks in Update Operations</p>\n\n<p>A field mask in update operations specifies which fields of the\ntargeted resource are going to be updated. The API is required\nto only change the values of the fields as specified in the mask\nand leave the others untouched. If a resource is passed in to\ndescribe the updated values, the API ignores the values of all\nfields not covered by the mask.</p>\n\n<p>If a repeated field is specified for an update operation, the existing\nrepeated values in the target resource will be overwritten by the new values.\nNote that a repeated field is only allowed in the last position of a +paths+\nstring.</p>\n\n<p>If a sub-message is specified in the last position of the field mask for an\nupdate operation, then the existing sub-message in the target resource is\noverwritten. Given the target message:</p>\n\n<pre><code>f {\n  b {\n    d : 1\n    x : 2\n  }\n  c : 1\n}\n</code></pre>\n\n<p>And an update message:</p>\n\n<pre><code>f {\n  b {\n    d : 10\n  }\n}\n</code></pre>\n\n<p>then if the field mask is:</p>\n\n<p>paths: “f.b”</p>\n\n<p>then the result will be:</p>\n\n<pre><code>f {\n  b {\n    d : 10\n  }\n  c : 1\n}\n</code></pre>\n\n<p>However, if the update mask was:</p>\n\n<p>paths: “f.b.d”</p>\n\n<p>then the result would be:</p>\n\n<pre><code>f {\n  b {\n    d : 10\n    x : 2\n  }\n  c : 1\n}\n</code></pre>\n\n<p>In order to reset a field’s value to the default, the field must\nbe in the mask and set to the default value in the provided resource.\nHence, in order to reset all fields of a resource, provide a default\ninstance of the resource and set all fields in the mask, or do\nnot provide a mask as described below.</p>\n\n<p>If a field mask is not present on update, the operation applies to\nall fields (as if a field mask of all fields has been specified).\nNote that in the presence of schema evolution, this may mean that\nfields the client does not know and has therefore not filled into\nthe request will be reset to their default. If this is unwanted\nbehavior, a specific service may require a client to always specify\na field mask, producing an error if not.</p>\n\n<p>As with get operations, the location of the resource which\ndescribes the updated values in the request message depends on the\noperation kind. In any case, the effect of the field mask is\nrequired to be honored by the API.</p>\n\n<p>== Considerations for HTTP REST</p>\n\n<p>The HTTP kind of an update operation which uses a field mask must\nbe set to PATCH instead of PUT in order to satisfy HTTP semantics\n(PUT must only be used for full updates).</p>\n\n<p>= JSON Encoding of Field Masks</p>\n\n<p>In JSON, a field mask is encoded as a single string where paths are\nseparated by a comma. Fields name in each path are converted\nto/from lower-camel naming conventions.</p>\n\n<p>As an example, consider the following message declarations:</p>\n\n<pre><code>message Profile {\n  User user = 1;\n  Photo photo = 2;\n}\nmessage User {\n  string display_name = 1;\n  string address = 2;\n}\n</code></pre>\n\n<p>In proto a field mask for +Profile+ may look as such:</p>\n\n<pre><code>mask {\n  paths: \"user.display_name\"\n  paths: \"photo\"\n}\n</code></pre>\n\n<p>In JSON, the same mask is represented as below:</p>\n\n<pre><code>{\n  mask: \"user.displayName,photo\"\n}\n</code></pre>\n\n<p>= Field Masks and Oneof Fields</p>\n\n<p>Field masks treat fields in oneofs just as regular fields. Consider the\nfollowing message:</p>\n\n<pre><code>message SampleMessage {\n  oneof test_oneof {\n    string name = 4;\n    SubMessage sub_message = 9;\n  }\n}\n</code></pre>\n\n<p>The field mask can be:</p>\n\n<pre><code>mask {\n  paths: \"name\"\n}\n</code></pre>\n\n<p>Or:</p>\n\n<pre><code>mask {\n  paths: \"sub_message\"\n}\n</code></pre>\n\n<p>Note that oneof type names (“test_oneof” in this case) cannot be used in\npaths.</p>","source":"google-cloud-logging/lib/google/cloud/logging/v2/doc/google/protobuf/field_mask.rb#L221","resources":[],"examples":[],"methods":[{"id":"paths-instance","type":"instance","name":"paths","title":["Google","Protobuf","FieldMask#paths"],"description":"","source":"google-cloud-logging/lib/google/cloud/logging/v2/doc/google/protobuf/field_mask.rb#L221","resources":[],"examples":[],"params":[],"exceptions":[],"returns":[{"types":["Array&lt;String&gt;"],"description":"The set of field mask paths."}]},{"id":"paths=-instance","type":"instance","name":"paths=","title":["Google","Protobuf","FieldMask#paths="],"description":"","source":"google-cloud-logging/lib/google/cloud/logging/v2/doc/google/protobuf/field_mask.rb#L221","resources":[],"examples":[],"params":[],"exceptions":[],"returns":[{"types":["Array&lt;String&gt;"],"description":"The set of field mask paths."}]}]}