{"id":"google/cloud/dialogflow/intents","name":"Intents","title":["Google","Cloud","Dialogflow","Intents"],"description":"","source":"google-cloud-dialogflow/lib/google/cloud/dialogflow.rb#L306","resources":[],"examples":[],"methods":[{"id":"new-class","type":"class","name":"new","title":["Google","Cloud","Dialogflow","Intents.new"],"description":"<p>An intent represents a mapping between input from a user and an action to\nbe taken by your application. When you pass user input to the\nGoogle::Cloud::Dialogflow::V2::Sessions::DetectIntent (or\nGoogle::Cloud::Dialogflow::V2::Sessions::StreamingDetectIntent) method, the\nDialogflow API analyzes the input and searches\nfor a matching intent. If no match is found, the Dialogflow API returns a\nfallback intent (+is_fallback+ = true).</p>\n\n<p>You can provide additional information for the Dialogflow API to use to\nmatch user input to an intent by adding the following to your intent.</p>\n\n<ul>\n  <li>\n    <p><strong>Contexts</strong> - provide additional context for intent analysis. For\nexample, if an intent is related to an object in your application that\nplays music, you can provide a context to determine when to match the\nintent if the user input is “turn it off”.  You can include a context\nthat matches the intent when there is previous user input of\n“play music”, and not when there is previous user input of\n“turn on the light”.</p>\n  </li>\n  <li>\n    <p><strong>Events</strong> - allow for matching an intent by using an event name\ninstead of user input. Your application can provide an event name and\nrelated parameters to the Dialogflow API to match an intent. For\nexample, when your application starts, you can send a welcome event\nwith a user name parameter to the Dialogflow API to match an intent with\na personalized welcome message for the user.</p>\n  </li>\n  <li>\n    <p><strong>Training phrases</strong> - provide examples of user input to train the\nDialogflow API agent to better match intents.</p>\n  </li>\n</ul>\n\n<p>For more information about intents, see the\n<a href=\"https://dialogflow.com/docs/intents\">Dialogflow documentation</a>.</p>","source":"google-cloud-dialogflow/lib/google/cloud/dialogflow.rb#L373","resources":[],"examples":[],"params":[{"name":"version","types":["Symbol","String"],"description":"The major version of the service to be used. By default :v2\nis used.","optional":true,"default":":v2","nullable":false}],"exceptions":[],"returns":[]}]}